## Series 和 DataFrame


他们都有自己的列的名字和行的索引

### Series

一维的


### DataFrame 

二维

In [1]:
import numpy as np

import pandas as pd

# from pandas import Series,DataFrame


pd.Series([1,3,5,'Hello',np.nan,6,8])

0        1
1        3
2        5
3    Hello
4      NaN
5        6
6        8
dtype: object

In [6]:
pd.Series([1,3,5,'Hello',np.nan,6,8],
         index=['A','B','C','D','E','F','G'])

A        1
B        3
C        5
D    Hello
E      NaN
F        6
G        8
dtype: object

In [8]:
pd.DataFrame([
                [1,3,5,'Hello',np.nan,6,8],
                [1,3,5,'Hello',np.nan,6,8],
                [1,3,5,'Hello',np.nan,6,8],
            ],
            index=['A','B','C'],
            columns=['C1','C2','C3','C4','C5','C6','C7']
         )

   C1  C2  C3     C4  C5  C6  C7
A   1   3   5  Hello NaN   6   8
B   1   3   5  Hello NaN   6   8
C   1   3   5  Hello NaN   6   8

## 访问数据


### 准备数据

随机生成6行4列的二维数组，行标签为从20210101到20210106的日期，列标签为A、B、C、D。

In [13]:
import numpy as np
import pandas as pd

df1 = pd.DataFrame(np.random.rand(6,4),
                   columns=['A','B','C','D'],
                   index = range(20210101,20210107)
                  )
df1

                 A         B         C         D
20210101  0.569454  0.164843  0.868869  0.455841
20210102  0.422232  0.898957  0.776008  0.002026
20210103  0.906858  0.484975  0.232417  0.190866
20210104  0.140987  0.293962  0.208519  0.414977
20210105  0.253512  0.542146  0.440114  0.651867
20210106  0.950277  0.795896  0.321630  0.066510

### head,tail

In [14]:
df1.head() # 默认显示前 5 行数据，head(3) 显示前 3 行数据

                 A         B         C         D
20210101  0.569454  0.164843  0.868869  0.455841
20210102  0.422232  0.898957  0.776008  0.002026
20210103  0.906858  0.484975  0.232417  0.190866
20210104  0.140987  0.293962  0.208519  0.414977
20210105  0.253512  0.542146  0.440114  0.651867

In [15]:
df1.tail(2)

                 A         B         C         D
20210105  0.253512  0.542146  0.440114  0.651867
20210106  0.950277  0.795896  0.321630  0.066510

### describe()  info()

关于这个数据集的相关描述，包含很多有用的统计信息

In [16]:
df1.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.540553  0.530130  0.474593  0.297014
std    0.334345  0.282155  0.282961  0.251587
min    0.140987  0.164843  0.208519  0.002026
25%    0.295692  0.341715  0.254720  0.097599
50%    0.495843  0.513561  0.380872  0.302921
75%    0.822507  0.732458  0.692034  0.445625
max    0.950277  0.898957  0.868869  0.651867

In [18]:
trainDF = pd.read_csv("./datasets/pandasbasic/train.csv")
type(trainDF)

pandas.core.frame.DataFrame

In [19]:
trainDF.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [20]:
trainDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

![qguTd5](https://upiclw.oss-cn-beijing.aliyuncs.com/uPic/qguTd5.png)

### sort

In [21]:
trainDF.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [23]:
sorted_df = trainDF.sort_values(by='Age')
sorted_df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
827,828,1,2,"Mallet, Master. Andre",male,1.00,0,2,S.C./PARIS 2079,37.0042,NaN,C
381,382,1,3,"Nakid, Miss. Maria (""Mary"")",female,1.00,0,2,2653,15.7417,NaN,C
164,165,0,3,"Panula, Master. Eino Viljami",male,1.00,4,1,3101295,39.6875,NaN,S

### nlargest()    largest  大     n 个数

In [25]:
trainDF.nlargest(5,'Age')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q

### sample  从数据中，随机的，采样，抽样

In [27]:
trainDF.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
688,689,0,3,"Fischer, Mr. Eberhard Thelander",male,18.0,0,0,350036,7.7958,NaN,S
784,785,0,3,"Ali, Mr. William",male,25.0,0,0,SOTON/O.Q. 3101312,7.0500,NaN,S
404,405,0,3,"Oreskovic, Miss. Marija",female,20.0,0,0,315096,8.6625,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
861,862,0,2,"Giles, Mr. Frederick Edward",male,21.0,1,0,28134,11.5000,NaN,S

### 获取单独的一列

In [29]:
s1 = trainDF['Ticket'] ## 单独根据列的名字来进行获取
type(s1)

pandas.core.series.Series

In [30]:
 trainDF.Cabin

0       NaN
1       C85
2       NaN
3      C123
4       NaN
       ...
886     NaN
887     B42
888     NaN
889    C148
890     NaN
Name: Cabin, Length: 891, dtype: object

### 获取行

In [32]:
trainDF[0:3] ## 列 ❌

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [35]:
trainDF.loc[1]

PassengerId                                                    2
Survived                                                       1
Pclass                                                         1
Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                       female
Age                                                           38
SibSp                                                          1
Parch                                                          0
Ticket                                                  PC 17599
Fare                                                     71.2833
Cabin                                                        C85
Embarked                                                       C
Name: 1, dtype: object

In [36]:
trainDF.iloc[3:5,0:3]

   PassengerId  Survived  Pclass
3            4         1       1
4            5         0       3

In [37]:
trainDF[['Ticket','Cabin']]

               Ticket Cabin
0           A/5 21171   NaN
1            PC 17599   C85
2    STON/O2. 3101282   NaN
3              113803  C123
4              373450   NaN
..                ...   ...
886            211536   NaN
887            112053   B42
888        W./C. 6607   NaN
889            111369  C148
890            370376   NaN

[891 rows x 2 columns]

### 过滤，布尔

In [38]:
filter = trainDF['Age'] > 18
filter

0       True
1       True
2       True
3       True
4       True
       ...
886     True
887     True
888    False
889     True
890     True
Name: Age, Length: 891, dtype: bool

In [39]:
trainDF[filter]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [40]:
trainDF[trainDF['Age'] > 75]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

## 缺失值

In [41]:
trainDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### dropna()

In [43]:
ddf = trainDF.dropna(how='any')
ddf

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [44]:
ddf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 183 entries, 1 to 889
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  183 non-null    int64
 1   Survived     183 non-null    int64
 2   Pclass       183 non-null    int64
 3   Name         183 non-null    object
 4   Sex          183 non-null    object
 5   Age          183 non-null    float64
 6   SibSp        183 non-null    int64
 7   Parch        183 non-null    int64
 8   Ticket       183 non-null    object
 9   Fare         183 non-null    float64
 10  Cabin        183 non-null    object
 11  Embarked     183 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 18.6+ KB

In [45]:
trainDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [46]:
ddf2 = trainDF.dropna(how='all')
ddf2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 90.5+ KB

### fillna

In [47]:
trainDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [48]:
trainDF.Age.mean()

29.69911764705882

In [50]:
ageDF = trainDF.fillna(trainDF.Age.mean())

In [51]:
ageDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [52]:
trainDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [55]:
ageDF2 = trainDF.fillna(value={'Age':trainDF.Age.mean()})
ageDF2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## 聚合  agg()

agg是Aggregate的缩写，意为聚合。

常用聚合方法如下：

* mean(): Compute mean of groups
* sum(): Compute sum of group values
* size(): Compute group sizes
* count(): Compute count of group
* std(): Standard deviation of groups
* var(): Compute variance of groups
* sem(): Standard error of the mean of groups
* describe(): Generates descriptive statistics
* first(): Compute first of group values
* last(): Compute last of group values
* nth() : Take nth value, or a subset if n is a list
* min(): Compute min of group values
* max(): Compute max of group values

In [56]:
trainDF.Age.mean()

29.69911764705882

In [57]:
trainDF.Age.count()

714

In [58]:
trainDF.agg({'Age':['max','min','count','mean'],'Sex':['sum']})

              Age                                                Sex
count  714.000000                                                NaN
max     80.000000                                                NaN
mean    29.699118                                                NaN
min      0.420000                                                NaN
sum           NaN  malefemalefemalefemalemalemalemalemalefemalefe...

## apply

In [59]:
trainDF.Age.apply(lambda n:n*2)

0      44.0
1      76.0
2      52.0
3      70.0
4      70.0
       ...
886    54.0
887    38.0
888     NaN
889    52.0
890    64.0
Name: Age, Length: 891, dtype: float64

In [64]:
def gender(mm):
    if mm=='male':
        return 1
    elif mm == 'female':
        return 0
    else:
        return 2


trainDF['Gender'] = trainDF.Sex.apply(gender)
trainDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  NEW          891 non-null    int64
 13  Gender       891 non-null    int64
dtypes: float64(2), int64(7), object(5)
memory usage: 97.6+ KB

In [62]:
trainDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [63]:
trainDF['NEW'] = 0

## 计数  value_counts

In [65]:
trainDF.Cabin.value_counts()

B96 B98        4
C23 C25 C27    4
G6             4
E101           3
D              3
              ..
B82 B84        1
E49            1
C86            1
C47            1
D7             1
Name: Cabin, Length: 147, dtype: int64

In [66]:
trainDF.Age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64

## concat 联结

In [69]:
age = trainDF.Age

In [70]:
sex = trainDF.Sex

In [72]:
pd.concat([age,sex])

0          22
1          38
2          26
3          35
4          35
        ...
886      male
887    female
888    female
889      male
890      male
Length: 1782, dtype: object

## merge()    sql join

## groupby 分组

In [73]:
trainDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  NEW          891 non-null    int64
 13  Gender       891 non-null    int64
dtypes: float64(2), int64(7), object(5)
memory usage: 97.6+ KB

### groupby 一列

In [74]:
 trainDF.groupby('Survived')

In [75]:
 trainDF.groupby('Survived').sum()

          PassengerId  Pclass       Age  SibSp  Parch        Fare  NEW  Gender
Survived
0              245412    1390  12985.50    304    181  12142.7199    0     468
1              151974     667   8219.67    162    159  16551.2294    0     109

In [77]:
trainDF[['Age','Survived']]

      Age  Survived
0    22.0         0
1    38.0         1
2    26.0         1
3    35.0         1
4    35.0         0
..    ...       ...
886  27.0         0
887  19.0         1
888   NaN         0
889  26.0         1
890  32.0         0

[891 rows x 2 columns]

In [80]:
trainDF[['Age','Survived']].groupby('Survived').std()

                Age
Survived
0         14.172110
1         14.950952

### 多列多聚合

In [83]:
trainDF.groupby(['Survived','Sex','Pclass']).sum()

                        PassengerId      Age  SibSp  Parch       Fare  NEW  \
Survived Sex    Pclass
0        female 1               975    77.00      2      4   331.8125    0
                2              2541   216.00      3      1   109.5000    0
                3             31707  1310.00     93     79  1423.6627    0
         male   1             31849  2719.50     21     20  4842.9081    0
                2             41315  2803.00     28     13  1773.4958    0
                3            137025  5860.00    157     64  3661.3408    0
1        female 1             43131  2865.00     50     39  9644.0125    0
                2             31135  1909.50     34     45  1560.2292    0
                3             25854   908.50     36     36   897.4459    0
         male   1             23750  1449.92     17     14  3358.6794    0
                2              7065   240.33      9     11   358.6167    0
                3             21039   846.42     16     14   732.2457    0

                        Gender
Survived Sex    Pclass
0        female 1            0
                2            0
                3            0
         male   1           77
                2           91
                3          300
1        female 1            0
                2            0
                3            0
         male   1           45
                2           17
                3           47

In [85]:
trainDF.groupby(['Survived','Sex','Pclass']).agg([np.sum,np.std,np.mean])

                       PassengerId                              Age  \
                               sum         std        mean      sum
Survived Sex    Pclass
0        female 1              975  162.194328  325.000000    77.00
                2             2541  322.594947  423.500000   216.00
                3            31707  263.865813  440.375000  1310.00
         male   1            31849  255.663741  413.623377  2719.50
                2            41315  255.021371  454.010989  2803.00
                3           137025  263.247078  456.750000  5860.00
1        female 1            43131  248.968916  473.967033  2865.00
                2            31135  238.617023  444.785714  1909.50
                3            25854  266.188419  359.083333   908.50
         male   1            23750  215.633410  527.777778  1449.92
                2             7065  272.558035  415.588235   240.33
                3            21039  255.919776  447.638298   846.42

                                             SibSp                     Parch  \
                              std       mean   sum       std      mean   sum
Survived Sex    Pclass
0        female 1       24.006943  25.666667     2  0.577350  0.666667     4
                2       12.915107  36.000000     3  0.547723  0.500000     1
                3       12.833465  23.818182    93  1.902093  1.291667    79
         male   1       14.457749  44.581967    21  0.553372  0.272727    20
                2       12.158125  33.369048    28  0.551610  0.307692    13
                3       12.135707  27.255814   157  1.354834  0.523333    64
1        female 1       13.223014  34.939024    50  0.671048  0.549451    39
                2       12.764693  28.080882    34  0.653704  0.485714    45
                3       12.303246  19.329787    36  0.888106  0.500000    36
         male   1       14.936744  36.248000    17  0.534657  0.377778    14
                2       19.547122  16.022000     9  0.624264  0.529412    11
                3       11.555786  22.274211    16  0.730592  0.340426    14

                        ...                 Fare                         NEW  \
                        ...      mean        sum         std        mean sum
Survived Sex    Pclass  ...
0        female 1       ...  1.333333   331.8125   70.920264  110.604167   0
                2       ...  0.166667   109.5000    6.969577   18.250000   0
                3       ...  1.097222  1423.6627   14.572275   19.773093   0
         male   1       ...  0.259740  4842.9081   60.052545   62.894910   0
                2       ...  0.142857  1773.4958   15.720548   19.488965   0
                3       ...  0.213333  3661.3408   10.984904   12.204469   0
1        female 1       ...  0.428571  9644.0125   74.738897  105.978159   0
                2       ...  0.642857  1560.2292   11.140937   22.288989   0
                3       ...  0.500000   897.4459    5.984714   12.464526   0
         male   1       ...  0.311111  3358.6794  101.091948   74.637320   0
                2       ...  0.647059   358.6167    9.832542   21.095100   0
                3       ...  0.297872   732.2457   15.232388   15.579696   0

                                 Gender
                        std mean    sum  std mean
Survived Sex    Pclass
0        female 1       0.0    0      0  0.0    0
                2       0.0    0      0  0.0    0
                3       0.0    0      0  0.0    0
         male   1       0.0    0     77  0.0    1
                2       0.0    0     91  0.0    1
                3       0.0    0    300  0.0    1
1        female 1       0.0    0      0  0.0    0
                2       0.0    0      0  0.0    0
                3       0.0    0      0  0.0    0
         male   1       0.0    0     45  0.0    1
                2       0.0    0     17  0.0    1
                3       0.0    0     47  0.0    1

[12 rows x 21 columns]

### 基于分组的不同列的不同的聚合

In [86]:
trainDF.groupby('Sex').agg({'Age':np.mean,'Pclass':np.sum})

              Age  Pclass
Sex
female  27.915709     678
male    30.726645    1379